tiborsimon/embedded-tdd-headers/pic/pic18/pic18f46k80_tdd.h
#define RXM0SIDH_SID10                2765
#define RXM0SIDL                      2766
#define RXM0SIDL_EID                  2767
#define RXM0SIDL_EID16                2768
#define RXM0EID16                     2769
#define RXM0EID17                     2770
#define RXM0SIDL_EID17                2771
#define RXM0SIDL_EXIDEN               2772
#define RXM0EXIDM                     2773
#define RXM0SID0                      2774
#define RXM0SIDL_SID0                 2775
#define RXM0SIDL_SID                  2776
#define RXM0SID1                      2777
#define RXM0SIDL_SID1                 2778
#define RXM0SID2                      2779
#define RXM0SIDL_SID2                 2780
#define RXM0EIDH                      2781
#define RXM0EIDH_EID8                 2782
#define RXM0EIDH_EID                  2783
#define RXM0EID8                      2784
#define RXM0EIDH_EID9                 2785
#define RXM0EID9                      2786
#define RXM0EIDH_EID10                2787
#define RXM0EID10                     2788
#define RXM0EIDH_EID11                2789
#define RXM0EID11                     2790
#define RXM0EIDH_EID12                2791
#define RXM0EID12                     2792
#define RXM0EIDH_EID13                2793
#define RXM0EID13                     2794
#define RXM0EIDH_EID14                2795
#define RXM0EID14                     2796
#define RXM0EIDH_EID15                2797
#define RXM0EID15                     2798
#define RXM0EIDL                      2799
#define RXM0EIDL_EID0                 2800
#define RXM0EIDL_EID                  2801
#define RXM0EID0                      2802
#define RXM0EIDL_EID1                 2803
#define RXM0EID1                      2804
#define RXM0EIDL_EID2                 2805
#define RXM0EID2                      2806
#define RXM0EIDL_EID3                 2807
#define RXM0EID3                      2808
#define RXM0EIDL_EID4                 2809
#define RXM0EID4                      2810
#define RXM0EIDL_EID5                 2811
#define RXM0EID5                      2812
#define RXM0EIDL_EID6                 2813
#define RXM0EID6                      2814
#define RXM0EIDL_EID7                 2815
#define RXM0EID7                      2816
#define RXM1SIDH                      2817
#define RXM1SID3                      2818
#define RXM1SIDH_SID3                 2819
#define RXM1SIDH_SID                  2820
#define RXM1SID4                      2821
#define RXM1SIDH_SID4                 2822
#define RXM1SID5                      2823
#define RXM1SIDH_SID5                 2824
#define RXM1SID6                      2825
#define RXM1SIDH_SID6                 2826
#define RXM1SID7                      2827
#define RXM1SIDH_SID7                 2828
#define RXM1SIDH_SID8                 2829
#define RXM1SID8                      2830
#define RXM1SID9                      2831
#define RXM1SIDH_SID9                 2832
#define RXM1SIDH_SID10                2833
#define RXM1SID10                     2834
#define RXM1SIDL                      2835
#define RXM1SIDL_EID16                2836
#define RXM1EID16                     2837
#define RXM1SIDL_EID                  2838
#define RXM1SIDL_EID17                2839
#define RXM1EID17                     2840
#define RXM1SIDL_EXIDEN               2841
#define RXM1EXIDEN                    2842
#define RXM1SIDL_SID0                 2843
#define RXM1SIDL_SID                  2844
#define RXM1SID0                      2845
#define RXM1SIDL_SID1                 2846
#define RXM1SID1                      2847
#define RXM1SIDL_SID2                 2848
#define RXM1SID2                      2849
#define RXM1EIDH                      2850
#define RXM1EID8                      2851
#define RXM1EIDH_EID8                 2852
#define RXM1EIDH_EID                  2853
#define RXM1EID9                      2854
#define RXM1EIDH_EID9                 2855
#define RXM1EIDH_EID10                2856
#define RXM1EID10                     2857
#define RXM1EID11                     2858
#define RXM1EIDH_EID11                2859
#define RXM1EIDH_EID12                2860
#define RXM1EID12                     2861
#define RXM1EIDH_EID13                2862
#define RXM1EID13                     2863
#define RXM1EIDH_EID14                2864
#define RXM1EID14                     2865
#define RXM1EIDH_EID15                2866
#define RXM1EID15                     2867
#define RXM1EIDL                      2868
#define RXM1EID0                      2869
#define RXM1EIDL_EID0                 2870
#define RXM1EIDL_EID                  2871
#define RXM1EID1                      2872
#define RXM1EIDL_EID1                 2873
#define RXM1EID2                      2874
#define RXM1EIDL_EID2                 2875
#define RXM1EID3                      2876
#define RXM1EIDL_EID3                 2877
#define RXM1EIDL_EID4                 2878
#define RXM1EID4                      2879
#define RXM1EIDL_EID5                 2880
#define RXM1EID5                      2881
#define RXM1EID6                      2882
#define RXM1EIDL_EID6                 2883
#define RXM1EID7                      2884
#define RXM1EIDL_EID7                 2885
#define TXB2CON                       2886
#define TXB2CON_TXPRI0                2887
#define TXB2PRI0                      2888
#define TXB2CON_TXPRI                 2889
#define TXB2CON_TXPRI1                2890
#define TXB2PRI1                      2891
#define TXB2REQ                       2892
#define TXB2CON_TXREQ                 2893
#define TXB2CON_TXERR                 2894
#define TXB2ERR                       2895
#define TXB2CON_TXLARB                2896
#define TXB2LARB                      2897
#define TXB2ABT                       2898
#define TXB2CON_TXABT                 2899
#define TXB2CON_TXBIF                 2900
#define TXB2CON_TX2IF                 2901
#define TXB2SIDH                      2902
#define TXB2SIDH_SID                  2903
#define TXB2SID3                      2904
#define TXB2SIDH_SID3                 2905
#define TXB2SID4                      2906
#define TXB2SIDH_SID4                 2907
#define TXB2SID5                      2908
#define TXB2SIDH_SID5                 2909
#define TXB2SID6                      2910
#define TXB2SIDH_SID6                 2911
#define TXB2SID7                      2912
#define TXB2SIDH_SID7                 2913
#define TXB2SID8                      2914
#define TXB2SIDH_SID8                 2915
#define TXB2SID9                      2916
#define TXB2SIDH_SID9                 2917
#define TXB2SIDH_SID10                2918
#define TXB2SID10                     2919
#define TXB2SIDL                      2920
#define TXB2SIDL_EID16                2921
#define TXB2EID16                     2922
#define TXB2SIDL_EID                  2923
#define TXB2SIDL_EID17                2924
#define TXB2EID17                     2925
#define TXB2SIDL_EXIDE                2926
#define TXB2EXIDE                     2927
#define TXB2SIDL_SRR                  2928
#define TXB2SIDL_SID                  2929
#define TXB2SID0                      2930
#define TXB2SIDL_SID0                 2931
#define TXB2SID1                      2932
#define TXB2SIDL_SID1                 2933
#define TXB2SID2                      2934
#define TXB2SIDL_SID2                 2935
#define TXB2EIDH                      2936
#define TXB2EIDH_EID8                 2937
#define TXB2EID8                      2938
#define TXB2EIDH_EID                  2939
#define TXB2EIDH_EID9                 2940
#define TXB2EID9                      2941
#define TXB2EIDH_EID10                2942
#define TXB2EID10                     2943
#define TXB2EIDH_EID11                2944
#define TXB2EID11                     2945
#define TXB2EIDH_EID12                2946
#define TXB2EID12                     2947
#define TXB2EIDH_EID13                2948
#define TXB2EID13                     2949
#define TXB2EIDH_EID14                2950
#define TXB2EID14                     2951
#define TXB2EIDH_EID15                2952
#define TXB2EID15                     2953
#define TXB2EIDL                      2954
#define TXB2EIDL_EID                  2955
#define TXB2EID0                      2956
#define TXB2EIDL_EID0                 2957
#define TXB2EID1                      2958
#define TXB2EIDL_EID1                 2959
#define TXB2EID2                      2960
#define TXB2EIDL_EID2                 2961
#define TXB2EID3                      2962
#define TXB2EIDL_EID3                 2963
#define TXB2EID4                      2964
#define TXB2EIDL_EID4                 2965
#define TXB2EID5                      2966
#define TXB2EIDL_EID5                 2967
#define TXB2EID6                      2968
#define TXB2EIDL_EID6                 2969
#define TXB2EID7                      2970
#define TXB2EIDL_EID7                 2971
#define TXB2DLC                       2972
#define TXB2DLC0                      2973
#define TXB2DLC_DLC0                  2974
#define TXB2DLC_DLC                   2975
#define TXB2DLC1                      2976
#define TXB2DLC_DLC1                  2977
#define TXB2DLC2                      2978
#define TXB2DLC_DLC2                  2979
#define TXB2DLC_DLC3                  2980
#define TXB2DLC3                      2981
#define TXB2DLC_TXRTR                 2982
#define TXB2RTR                       2983
#define TXB2D00                       2984
#define TXB2D0                        2985
#define TXB2D01                       2986
#define TXB2D02                       2987
#define TXB2D03                       2988
#define TXB2D04                       2989
#define TXB2D05                       2990
#define TXB2D06                       2991
#define TXB2D07                       2992
#define TXB2D10                       2993
#define TXB2D1                        2994
#define TXB2D11                       2995
#define TXB2D12                       2996
#define TXB2D13                       2997
#define TXB2D14                       2998
#define TXB2D15                       2999
#define TXB2D16                       3000
#define TXB2D17                       3001
#define TXB2D2                        3002
#define TXB2D20                       3003
#define TXB2D21                       3004
#define TXB2D22                       3005
#define TXB2D23                       3006
#define TXB2D24                       3007
#define TXB2D25                       3008
#define TXB2D26                       3009
#define TXB2D27                       3010
#define TXB2D3                        3011
#define TXB2D30                       3012
#define TXB2D31                       3013
#define TXB2D32                       3014
#define TXB2D33                       3015
#define TXB2D34                       3016
#define TXB2D35                       3017
#define TXB2D36                       3018
#define TXB2D37                       3019
#define TXB2D40                       3020
#define TXB2D4                        3021
#define TXB2D41                       3022
#define TXB2D42                       3023
#define TXB2D43                       3024
#define TXB2D44                       3025
#define TXB2D45                       3026
#define TXB2D46                       3027
#define TXB2D47                       3028
#define TXB2D50                       3029
#define TXB2D5                        3030
#define TXB2D51                       3031
#define TXB2D52                       3032
#define TXB2D53                       3033
#define TXB2D54                       3034
#define TXB2D55                       3035
#define TXB2D56                       3036
#define TXB2D57                       3037
#define TXB2D60                       3038
#define TXB2D6                        3039
#define TXB2D61                       3040
#define TXB2D62                       3041
#define TXB2D63                       3042
#define TXB2D64                       3043
#define TXB2D65                       3044
#define TXB2D66                       3045
#define TXB2D67                       3046
#define TXB2D70                       3047
#define TXB2D7                        3048
#define TXB2D71                       3049
#define TXB2D72                       3050
#define TXB2D73                       3051
#define TXB2D74                       3052
#define TXB2D75                       3053
#define TXB2D76                       3054
#define TXB2D77                       3055
#define CANSTAT_RO3                   3056
#define CANSTAT_RO3_EICODE0           3057
#define CANSTAT_RO3_EICODE1           3058
#define CANSTAT_RO3_ICODE0            3059
#define CANSTAT_RO3_EICODE1_ICODE0    3060
#define CANSTAT_RO3_EICODE2           3061
#define CANSTAT_RO3_EICODE2_ICODE1    3062
#define CANSTAT_RO3_ICODE1            3063
#define CANSTAT_RO3_EICODE3_ICODE2    3064
#define CANSTAT_RO3_EICODE3           3065
#define CANSTAT_RO3_ICODE2            3066
#define CANSTAT_RO3_EICODE4           3067
#define CANSTAT_RO3_OPMODE            3068
#define CANSTAT_RO3_OPMODE0           3069
#define CANSTAT_RO3_OPMODE1           3070
#define CANSTAT_RO3_OPMODE2           3071
#define CANCON_RO3                    3072
#define CANCON_RO3_FP0                3073
#define CANCON_RO3_FP1                3074
#define CANCON_RO3_WIN0_FP1           3075
#define CANCON_RO3_WIN0               3076
#define CANCON_RO3_WIN1_FP2           3077
#define CANCON_RO3_WIN1               3078
#define CANCON_RO3_FP2                3079
#define CANCON_RO3_WIN2_FP3           3080
#define CANCON_RO3_WIN2               3081
#define CANCON_RO3_FP3                3082
#define CANCON_RO3_ABAT               3083
#define CANCON_RO3_REQOP              3084
#define TXB1CON                       3085
#define TXB1CON_TXPRI                 3086
#define TXB1PRI0                      3087
#define TXB1CON_TXPRI0                3088
#define TXB1PRI1                      3089
#define TXB1CON_TXPRI1                3090
#define TXB1REQ                       3091
#define TXB1CON_TXREQ                 3092
#define TXB1CON_TXERR                 3093
#define TXB1ERR                       3094
#define TXB1LARB                      3095
#define TXB1CON_TXLARB                3096
#define TXB1ABT                       3097
#define TXB1CON_TXABT                 3098
#define TXB1CON_TX1IF                 3099
#define TXB1CON_TXBIF                 3100
#define TXB1SIDH                      3101
#define TXB1SIDH_SID3                 3102
#define TXB1SID3                      3103
#define TXB1SIDH_SID                  3104
#define TXB1SIDH_SID4                 3105
#define TXB1SID4                      3106
#define TXB1SIDH_SID5                 3107
#define TXB1SID5                      3108
#define TXB1SIDH_SID6                 3109
#define TXB1SID6                      3110
#define TXB1SIDH_SID7                 3111
#define TXB1SID7                      3112
#define TXB1SIDH_SID8                 3113
#define TXB1SID8                      3114
#define TXB1SIDH_SID9                 3115
#define TXB1SID9                      3116
#define TXB1SID10                     3117
#define TXB1SIDH_SID10                3118
#define TXB1SIDL                      3119
#define TXB1SIDL_EID16                3120
#define TXB1EID16                     3121
#define TXB1SIDL_EID                  3122
#define TXB1SIDL_EID17                3123
#define TXB1EID17                     3124
#define TXB1EXIDE                     3125
#define TXB1SIDL_EXIDE                3126
#define TXB1SIDL_SRR                  3127
#define TXB1SIDL_SID                  3128
#define TXB1SID0                      3129
#define TXB1SIDL_SID0                 3130
#define TXB1SID1                      3131
#define TXB1SIDL_SID1                 3132
#define TXB1SID2                      3133
#define TXB1SIDL_SID2                 3134
#define TXB1EIDH                      3135
#define TXB1EID8                      3136
#define TXB1EIDH_EID                  3137
#define TXB1EIDH_EID8                 3138
#define TXB1EID9                      3139
#define TXB1EIDH_EID9                 3140
#define TXB1EID10                     3141
#define TXB1EIDH_EID10                3142
#define TXB1EID11                     3143
#define TXB1EIDH_EID11                3144
#define TXB1EID12                     3145
#define TXB1EIDH_EID12                3146
#define TXB1EID13                     3147
#define TXB1EIDH_EID13                3148
#define TXB1EID14                     3149
#define TXB1EIDH_EID14                3150
#define TXB1EID15                     3151
#define TXB1EIDH_EID15                3152
#define TXB1EIDL                      3153
#define TXB1EIDL_EID0                 3154
#define TXB1EID0                      3155
#define TXB1EIDL_EID                  3156
#define TXB1EIDL_EID1                 3157
#define TXB1EID1                      3158
#define TXB1EIDL_EID2                 3159
#define TXB1EID2                      3160
#define TXB1EIDL_EID3                 3161
#define TXB1EID3                      3162
#define TXB1EIDL_EID4                 3163
#define TXB1EID4                      3164
#define TXB1EIDL_EID5                 3165
#define TXB1EID5                      3166
#define TXB1EIDL_EID6                 3167
#define TXB1EID6                      3168
#define TXB1EIDL_EID7                 3169
#define TXB1EID7                      3170
#define TXB1DLC                       3171
#define TXB1DLC_DLC                   3172
#define TXB1DLC0                      3173
#define TXB1DLC_DLC0                  3174
#define TXB1DLC_DLC1                  3175
#define TXB1DLC1                      3176
#define TXB1DLC_DLC2                  3177
#define TXB1DLC2                      3178
#define TXB1DLC_DLC3                  3179
#define TXB1DLC3                      3180
#define TXB1RTR                       3181
#define TXB1DLC_TXRTR                 3182
#define TXB1D0                        3183
#define TXB1D00                       3184
#define TXB1D01                       3185
#define TXB1D02                       3186
#define TXB1D03                       3187
#define TXB1D04                       3188
#define TXB1D05                       3189
#define TXB1D06                       3190
#define TXB1D07                       3191
#define TXB1D1                        3192
#define TXB1D10                       3193
#define TXB1D11                       3194
#define TXB1D12                       3195
#define TXB1D13                       3196
#define TXB1D14                       3197
#define TXB1D15                       3198
#define TXB1D16                       3199
#define TXB1D17                       3200
#define TXB1D2                        3201
#define TXB1D20                       3202
#define TXB1D21                       3203
#define TXB1D22                       3204
#define TXB1D23                       3205
#define TXB1D24                       3206
#define TXB1D25                       3207
#define TXB1D26                       3208
#define TXB1D27                       3209
#define TXB1D3                        3210
#define TXB1D30                       3211
#define TXB1D31                       3212
#define TXB1D32                       3213
#define TXB1D33                       3214
#define TXB1D34                       3215
#define TXB1D35                       3216
#define TXB1D36                       3217
#define TXB1D37                       3218
#define TXB1D4                        3219
#define TXB1D40                       3220
#define TXB1D41                       3221
#define TXB1D42                       3222
#define TXB1D43                       3223
#define TXB1D44                       3224
#define TXB1D45                       3225
#define TXB1D46                       3226
#define TXB1D47                       3227
#define TXB1D50                       3228
#define TXB1D5                        3229
#define TXB1D51                       3230
#define TXB1D52                       3231
#define TXB1D53                       3232
#define TXB1D54                       3233
#define TXB1D55                       3234
#define TXB1D56                       3235
#define TXB1D57                       3236
#define TXB1D60                       3237
#define TXB1D6                        3238
#define TXB1D61                       3239
#define TXB1D62                       3240
#define TXB1D63                       3241
#define TXB1D64                       3242
#define TXB1D65                       3243
#define TXB1D66                       3244
#define TXB1D67                       3245
#define TXB1D70                       3246
#define TXB1D7                        3247
#define TXB1D71                       3248
#define TXB1D72                       3249
#define TXB1D73                       3250
#define TXB1D74                       3251
#define TXB1D75                       3252
#define TXB1D76                       3253
#define TXB1D77                       3254
#define CANSTAT_RO2                   3255
#define CANSTAT_RO2_EICODE0           3256
#define CANSTAT_RO2_EICODE1_ICODE0    3257
#define ICODE20                       3258
#define CANSTAT_RO2_EICODE1           3259
#define CANSTAT_RO2_EICODE2_ICODE1    3260
#define ICODE21                       3261
#define CANSTAT_RO2_EICODE2           3262
#define CANSTAT_RO2_EICODE3_ICODE2    3263
#define CANSTAT_RO2_ICODE2            3264
#define CANSTAT_RO2_EICODE3           3265
#define CANSTAT_RO2_EICODE4           3266
#define CANSTAT_RO2_OPMODE0           3267
#define CANSTAT_RO2_OPMODE            3268
#define CANSTAT_RO2_OPMODE1           3269
#define CANSTAT_RO2_OPMODE2           3270
#define CANCON_RO2                    3271
#define CANCON_RO2_FP0                3272
#define CANCON_RO2_WIN0               3273
#define CANCON_RO2_FP1                3274
#define CANCON_RO2_WIN0_FP1           3275
#define CANCON_RO2_WIN1_FP2           3276
#define CANCON_RO2_WIN1               3277
#define CANCON_RO2_FP2                3278
#define CANCON_RO2_FP3                3279
#define CANCON_RO2_WIN2               3280
#define CANCON_RO2_WIN2_FP3           3281
#define CANCON_RO2_ABAT               3282
#define CANCON_RO2_REQOP              3283
#define TXB0CON                       3284
#define TXB0PRI0                      3285
#define TXB0CON_TXPRI0                3286
#define TXB0CON_TXPRI                 3287
#define TXB0CON_TXPRI1                3288
#define TXB0PRI1                      3289
#define TXB0REQ                       3290
#define TXB0CON_TXREQ                 3291
#define TXB0CON_TXERR                 3292
#define TXB0ERR                       3293
#define TXB0CON_TXLARB                3294
#define TXB0LARB                      3295
#define TXB0CON_TXABT                 3296
#define TXB0ABT                       3297
#define TXB0CON_TXBIF                 3298
#define TX0IF                         3299
#define TXB0SIDH                      3300
#define TXB0SID3                      3301
#define TXB0SIDH_SID3                 3302
#define TXB0SIDH_SID                  3303
#define TXB0SID4                      3304
#define TXB0SIDH_SID4                 3305
#define TXB0SID5                      3306
#define TXB0SIDH_SID5                 3307
#define TXB0SID6                      3308
#define TXB0SIDH_SID6                 3309
#define TXB0SID7                      3310
#define TXB0SIDH_SID7                 3311
#define TXB0SID8                      3312
#define TXB0SIDH_SID8                 3313
#define TXB0SID9                      3314
#define TXB0SIDH_SID9                 3315
#define TXB0SIDH_SID10                3316
#define TXB0SID10                     3317
#define TXB0SIDL                      3318
#define TXB0SIDL_EID                  3319
#define TXB0SIDL_EID16                3320
#define TXB0EID16                     3321
#define TXB0SIDL_EID17                3322
